# 1913 Restaurant Data
Goal: Create a set of uniform code for cleaning up the street names and street numbers.

In [1]:
import pandas as pd

## Master

In [2]:
DF = pd.read_csv('datasets/1880_streets_full.csv')
DF.head(1)

,street_name,odd_on,avg_direction,building_num_range,start_end_coordinates,segment_length,segment_direction,building_num_range_length,avg_length_per_building,direction_deviation,road_type,offset_from_road_center
0,10th Avenue,left,-170.561731,"[1, 19]","[[40.741073, -74.009227], [40.739952, -74.0094...",126.194091,-170.561731,19,6.641794,0.0,Avenue,10

In [3]:
DF['street_name'].value_counts()

10th Avenue          164
8th Avenue           148
5th Avenue           129
2nd Avenue           129
3rd Avenue           126
                    ...
Varick Place           1
Liberty Place          1
Jones Street           1
Blackwells  N          1
Vandewater Street      1
Name: street_name, Length: 666, dtype: int64

In [4]:
master_list = list(dict(DF['street_name'].value_counts()).keys())
#sorted(master_list)

## 1913

In [5]:
df1 = pd.read_csv('datasets/1913Final.csv')
df1.head()

,Year,PG,ID,ID2,CAT_ORG,FULL,Position,Nation,Name,NATIONALITY,...,region_api,prob1_api,prob2_api,>40,match_country,nation,countries match,regions match,"name error (""Y"" if the first and last columns are not valid names. i.e. ""Smith's Inc."")","useable last name (if entered ""Y"" in the previous column, enter the last name contained in the restaurant name if applicable. i.e. for ""Smith's Restaurant"", please enter ""Smith"")"
0,1913_TrowBusMan,904,33,1913_TrowBusMan_33,Restaurants,"Albanian Roumanian Co, 261 W37th",23,NaN,Albanian Roumanian Co,Albanian,...,Eastern Europe,0.494082,0.479671,1,FALSE,NaN,FALSE,FALSE,NaN,NaN
1,1913_TrowBusMan,908,1161,1913_TrowBusMan_1161,Restaurants,Garbade Emily D. 78 W Houston,17,NaN,Garbade Emily D,American,...,Northern Europe,0.477784,0.651728,1,FALSE,German,FALSE,FALSE,NaN,NaN
2,1913_TrowBusMan,908,1124,1913_TrowBusMan_1124,Restaurants,"Frese Ida L, 2 W33d",13,NaN,Frese Ida L,"American, German",...,Western Asia,0.510736,0.573118,1,FALSE,Italy,FALSE,German Jew,NaN,NaN
3,1913_TrowBusMan,905,77,1913_TrowBusMan_77,Restaurants,"Aram Ada. 1902, 7th av",10,NaN,Aram Ada,Armenian,...,Western Africa,0.477573,0.442362,1,FALSE,Turkey,FALSE,FALSE,NaN,NaN
4,1913_TrowBusMan,906,430,1913_TrowBusMan_430,Restaurants,"Cafe Safran, 265, 4th av",13,NaN,Cafe Safran,Armenian,...,Northern Europe,0.679962,0.68712,1,FALSE,NaN,FALSE,FALSE,Y,Safran

In [6]:
df1.shape

(5419, 36)

In [7]:
df1.columns

Index(['Year', 'PG', 'ID', 'ID2', 'CAT_ORG', 'FULL', 'Position', 'Nation',
       'Name', 'NATIONALITY', 'NATIONALITY final', 'GENDER', 'Gender_api',
       'Gender_same', 'gender_final', 'ST Name', 'ST Name 2', 'ST Name 3',
       'ST Name 4', 'ST Name 5', 'ST Name 6', 'First', 'Last', 'country1_api',
       'country2_api', 'score_api', 'region_api', 'prob1_api', 'prob2_api',
       '>40', 'match_country', 'nation', 'countries match', 'regions match',
       'name error ("Y" if the first and last columns are not valid names. i.e. "Smith's Inc.")',
       'useable last name (if entered "Y" in the previous column, enter the last name contained in the restaurant name if applicable. i.e. for "Smith's Restaurant", please enter "Smith")'],
      dtype='object')

Get the columns I need.

In [8]:
df1 = df1[['FULL', 'Name', 'gender_final', 'countries match', 'regions match']]
df1.head()

,FULL,Name,gender_final,countries match,regions match
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE
1,Garbade Emily D. 78 W Houston,Garbade Emily D,f,FALSE,FALSE
2,"Frese Ida L, 2 W33d",Frese Ida L,f,FALSE,German Jew
3,"Aram Ada. 1902, 7th av",Aram Ada,f,FALSE,FALSE
4,"Cafe Safran, 265, 4th av",Cafe Safran,Unknown,FALSE,FALSE

In [9]:
df2 = pd.read_csv('datasets/1913TrowBus.csv')
df2.head()

,Year,PG,ID,ID2,CAT_ORG,FULL,Position,Nation,Name,NATIONALITY,...,Addy_Clean,Address,CORNER,ST combi,ST Name,ST Name 2,ST Name 3,ST Name 4,ST Name 5,ST Name 6
0,1913_TrowBusMan,904,33,1913_TrowBusMan_33,Restaurants,"Albanian Roumanian Co, 261 W37th",23,NaN,Albanian Roumanian Co,Albanian,...,261 W 37th,261 W37th,N,W 37th,261,W37th,NaN,NaN,NaN,NaN
1,1913_TrowBusMan,908,1161,1913_TrowBusMan_1161,Restaurants,Garbade Emily D. 78 W Houston,17,NaN,Garbade Emily D,American,...,78 W Houston,78 W Houston,N,W Houston,78,W,Houston,NaN,NaN,NaN
2,1913_TrowBusMan,908,1124,1913_TrowBusMan_1124,Restaurants,"Frese Ida L, 2 W33d",13,NaN,Frese Ida L,"American, German",...,2 W 33rd,2 W33d,N,W 33rd,2,W33d,NaN,NaN,NaN,NaN
3,1913_TrowBusMan,905,77,1913_TrowBusMan_77,Restaurants,"Aram Ada. 1902, 7th av",10,NaN,Aram Ada,Armenian,...,1902 7th av,"1902, 7th av",N,7th av,1902,7th,av,NaN,NaN,NaN
4,1913_TrowBusMan,906,430,1913_TrowBusMan_430,Restaurants,"Cafe Safran, 265, 4th av",13,NaN,Cafe Safran,Armenian,...,265 4th av,"265, 4th av",N,4th av,265,4th,av,NaN,NaN,NaN

In [10]:
df2.columns

Index(['Year', 'PG', 'ID', 'ID2', 'CAT_ORG', 'FULL', 'Position', 'Nation',
       'Name', 'NATIONALITY', 'NATIONALITY final', 'GENDER', 'Unnamed: 12',
       'Addy_Clean', 'Address', 'CORNER', 'ST combi', 'ST Name', 'ST Name 2',
       'ST Name 3', 'ST Name 4', 'ST Name 5', 'ST Name 6'],
      dtype='object')

In [11]:
df2 = df2[['FULL', 'Name', 'Addy_Clean', 'ST combi']]
df2.head()

,FULL,Name,Addy_Clean,ST combi
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,261 W 37th,W 37th
1,Garbade Emily D. 78 W Houston,Garbade Emily D,78 W Houston,W Houston
2,"Frese Ida L, 2 W33d",Frese Ida L,2 W 33rd,W 33rd
3,"Aram Ada. 1902, 7th av",Aram Ada,1902 7th av,7th av
4,"Cafe Safran, 265, 4th av",Cafe Safran,265 4th av,4th av

In [12]:
df1['FULL'] = df1['FULL'].str.strip()
df1['Name'] = df1['Name'].str.strip()

df2['FULL'] = df2['FULL'].str.strip()
df2['Name'] = df2['Name'].str.strip()

In [13]:
df = pd.merge(df1, df2, on=['FULL', 'Name'])
df.head()

,FULL,Name,gender_final,countries match,regions match,Addy_Clean,ST combi
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th
1,Garbade Emily D. 78 W Houston,Garbade Emily D,f,FALSE,FALSE,78 W Houston,W Houston
2,"Frese Ida L, 2 W33d",Frese Ida L,f,FALSE,German Jew,2 W 33rd,W 33rd
3,"Aram Ada. 1902, 7th av",Aram Ada,f,FALSE,FALSE,1902 7th av,7th av
4,"Cafe Safran, 265, 4th av",Cafe Safran,Unknown,FALSE,FALSE,265 4th av,4th av

In [14]:
df.shape

(8730, 7)

In [15]:
df = df.drop_duplicates()
df.shape

(5293, 7)

In [16]:
df.columns = ['full', 'name', 'gender', 'country', 'region', 'address', 'street']
df.head(1)

,full,name,gender,country,region,address,street
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th

In [17]:
df['num'] = df['address'].str.split().str[0]
df.head(1)

,full,name,gender,country,region,address,street,num
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th,261

### Street

### systematic cleaning

#### strip unnecessary white spaces

In [18]:
df['street_clean'] = df['street'].str.strip()
df.head(1)

,full,name,gender,country,region,address,street,num,street_clean
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th,261,W 37th

Inspect `street_clean` data.

In [19]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

#### add "street" after "E xxth" or "W xxth"

In [20]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x+' Street' if x.startswith('E ') | x.startswith('W ') else x)
df.head(1)

,full,name,gender,country,region,address,street,num,street_clean
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th,261,W 37th Street

In [21]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

#### replace abbreviation with full names.

In [22]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' st', ' Street') if x.endswith(' st') else x)

In [23]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' St', ' Street') if x.endswith(' St') else x)

In [24]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' av', ' Avenue') if x.endswith(' av') else x)

In [25]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' pl', ' Place') if x.endswith(' pl') else x)

In [26]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' mkt', ' Market') if x.endswith(' mkt') else x)

In [27]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' ln', ' Lane') if x.endswith(' ln') else x)

In [28]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' sq', ' Square') if x.endswith(' sq') else x)

In [29]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' slip', ' Slip') if x.endswith(' slip') else x)

In [30]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' sl', ' Slip') if x.endswith(' sl') else x)

In [31]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' pkway', ' Parkway') if x.endswith(' pkway') else x)

In [32]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' rd', ' Road') if x.endswith(' rd') else x)

In [33]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' pk', ' Park') if x.endswith(' pk') else x)

In [34]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

#### add "street" to all the ones with only one word

In [35]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x+' Street' if len(x.split())==1 else x)

In [36]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

### cross check results

In [37]:
streets_list = list(dict(df['street_clean'].value_counts()).keys())
streets_list[:5]

['3rd Avenue', 'Broadway Street', '8th Avenue', '2nd Avenue', '6th Avenue']

In [38]:
for street in streets_list:
    if street not in master_list:
        print(street)

Broadway Street
Amsterdam Avenue
Columbus Avenue
E Houston Street
Lenox Avenue
E Broadway Street
Ave A
Park row
Westchester Avenue
Ave C
Willis Avenue
W Broadway Street
Ave B
6th Street
3rd Street
E 138th Street
5th Street
W Houston Street
2nd Street
Lafayette Street
Ave D
Boston Road
Prospect Avenue
Webster Avenue
St Nicholas Avenue
7th Street
Macdougal Street
Brook Avenue
E 149th Street
St Mark's Place
E Tremont av Street
S Boulevard
Cathedral Parkway
Courtlandt Avenue
Morris Avenue
1st Street
Marginal Street
Columbus Circle
Washington Avenue
Cooper sq E
Union sq E
Wendover Avenue
City Id Avenue
E Fordham rd Street
Kenmare Street
Washington Market
Jerome Avenue
White Plains Road
E 169th Street
Melrose Avenue
Manhattan Avenue
Little W12th
Chatham Square
E 187th Street
E 180th Street
Arthur Avenue
E 102nd Street
Tremont Avenue
Wilkins Avenue
E End av Street
St Ann's Avenue
Central pk W
Gt Jones
E 163rd Street
W 8th Street
Washington sq S
Fulton Market
N Moore
Forest Avenue
Pleasant Avenue
Villa Avenue
Westchester Square
Freeman Street
E 151st Street
New Chambers
Hamilton Place
E 174th Street
Clay Avenue
Trinity Place
W 22th Street
Burling Street
Edgecombe Avenue
Longwood Avenue
Hanover Square
S William
E 165th Street
Claremont Avenue
Lexington Street
Washington sq W
Central Station
E 155th Street
Macomb's Road
E 101st Street
E 143rd Street
Bergen Avenue
E 158th Street
Fox Street
Catherine Market
E 100th Street
Harlem Market
Waverley Place
Union Avenue
Ogden Avenue
Morris pk Avenue
E 137th Street
123rd Street
Morningside drive
E 150th Street
Riverside drive
W End Av Street
Cypress Avenue
Bible h
Home Street
E 161st Street
Thompson Avenue
W 18st Street
E 183rd Street
Central pk S
E 160th Street
Newell Avenue
Hughes Avenue
Bathgate Avenue
E 148th Street
Alex Avenue
Belmont Avenue
Washington sq E
Ditmars City Id

### manual cleaning

In [39]:
STREET = {
    # unmatched
    # 123rd Street
    # W 8th Street
    # W 22th Street
    # W 18st Street
    # E 100th Street
    # E 101st Street
    # E 102nd Street
    # E 137th Street
    # E 138th Street
    # E 143rd Street
    # E 148th Street
    # E 149th Street
    # E 150th Street
    # E 151st Street
    # E 155th Street
    # E 158th Street
    # E 160th Street
    # E 161st Street
    # E 163rd Street
    # E 165th Street
    # E 169th Street
    # E 174th Street
    # E 180th Street
    # E 183rd Street
    # E 187th Street
    
    # street added wrongly
    '1st Street': '1st Avenue',
    '2nd Street': '2nd Avenue',
    '3 Avenue': '3rd Avenue',
    'c 3rd Avenue': '3rd Avenue',
    '3rd Street': '3rd Avenue',
    '5th Street': '5th Avenue',
    '6th Street': '6th Avenue',
    '7th Street': '7th Avenue',
    '8th Street': '8th Avenue',
    '8d Avenue': '8th Avenue',
    '9th Street': '9th Avenue',
    'Broadway Street': 'Broadway',
    
    # direction order
    'W Broadway Street': 'Broadway W',
    'E Broadway Street': 'Broadway E',
    'W Houston Street': 'Houston Street W',
    'E Houston Street': 'Houston Street E',
    'N Moore': 'Moore Street N',
    'S William': 'William Street S',
    'N William': 'William Street N',
    'Union sq E': 'Union Square E',
    'Little W 12th': 'W 12th Street',
    'E 145th Street': 'E 145th Street',
    
    # title case
    'Park row': 'Park Row',
    'James slip': 'James Slip',
    'Old slip': 'Old Slip',
    'Catherine slip': 'Catherine Slip',
    'Peck slip'
    
    # order
    'Av A': 'A Avenue',
    'Ave A': 'A Avenue',
    'Av B': 'B Avenue',
    'Ave B': 'B Avenue',
    'Av C': 'C Avenue',
    'Ave C': 'C Avenue',
    'av c W': 'C Avenue',
    'Av D': 'D Avenue',
    'Ave D': 'D Avenue',
    'av n E': 'East Avenue',
    'av n W': 'West Avenue',
    'W End av Street': 'West Avenue',
    'W End Av Street': 'West Avenue',
    
    # same name
    'Centre Market': 'Centre Market Place',
    'Clinton Market': 'Clinton Place',
    'Chatham Square': 'Chatham Street',
    'Catherine Market': 'Catherine Street',
    'Fulton Market': 'Fulton Street',
    'Grand st Circle': 'Grand Street',
    'Jefferson Market': 'Jefferson Street',
    'Stone William': 'Stone Street',
    'Tompkins Market': 'Tompkins Street',
    'Washington Market': 'Washington Place',
    'Hanover Square': 'Hanover Street',
    'New Chambers': 'New Chambers Street',
    'Thompson Avenue': 'Thompson Street',
    'Union Avenue': 'Union Square',
    'Lexington Street': 'Lexington Avenue',
    'Morris pk Avenue': 'Morris Street',
    
    # different spelling
    'Macdougal Street': 'Mac Dougal Street',
    'St Mark’s Place': 'Saint Marks Place',
    'St Mark\'s Place': 'Saint Marks Place',
    'VandeWater Street': 'Vandewater Street',
    'Riverside drive': 'Riverside Driveway',
    'Newell Avenue': 'New Avenue',
    'Washington sq E': 'Washington Square E',
    'Washington sq W': 'Washington Square W',
    'Washington sq S': 'Washington Square S',
    'Waverley Place': 'Waverly Place',
    'Hamilton Place': 'Hamilton Street',
    'Morris Avenue': 'Morris Street',
    'Courtlandt Avenue': 'Courtlandt Street',
    'Lafayette Street': 'Lafayette Place',
    'Boston Road': 'Bolton Road',
    'Washington Avenue': 'Washington Street',
    'Burling Street': 'Burling Slip'
    
    
    # unmatched avenues
    # Alex Avenue
    # Amsterdam Avenue
    # Lincoln Avenue
    # Tremont Avenue
    # Brook Avenue
    # Willis Avenue
    # Columbus Avenue
    # Bergen Avenue
    # Hughes Avenue
    # Claremont Avenue
    # Clay Avenue
    # Bathgate Avenue
    # Forest Avenue
    # Pleasant Avenue
    # Cypress Avenue
    # Edgecombe Avenue
    # Ogden Avenue
    # Longwood Avenue
    # Belmont Avenue
    # Villa Avenue
    # Arthur Avenue
    # Wilkins Avenue
    # Tremont Avenue
    # Jerome Avenue
    # Lenox Avenue
    # Westchester Avenue
    # Prospect Avenue
    # St Nicholas Avenue
    # Webster Avenue
    # Wendover Avenue
    # City Id Avenue
    # Melrose Avenue
    # Manhattan Avenue
    # St Ann's Avenue
    # Jerome Avenue
    
    # unmatched
    # Trinity Place
    # Bible h
    # Home Street
    # Columbus Circle
    # Central pk W
    # E End av Street
    # Little W12th
    # Gt Jones
    # Westchester Square
    # Freeman Street
    # Central pk S
    # Harlem Market
    # Trinity Place
    # Ditmars City Id
    # Central Station
    # Morningside drive
    # Fox Street
    # Macomb's Road
    # Cathedral Parkway
    # Cooper sq E
    # S Boulevard
    # E Tremont av Street
    # Marginal Street
    # Kenmare Street
    # E Fordham rd Street
    # White Plains Road
}

In [40]:
df = df.replace({'street_clean': STREET})
df.head(1)

,full,name,gender,country,region,address,street,num,street_clean
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th,261,W 37th Street

In [41]:
streets_list = list(dict(df['street_clean'].value_counts()).keys())
streets_list[:5]

['3rd Avenue', 'Broadway', '8th Avenue', '2nd Avenue', '6th Avenue']

### cross check results

In [42]:
for street in streets_list:
    if street not in master_list:
        print(street)

Amsterdam Avenue
Columbus Avenue
Lenox Avenue
Broadway E
Westchester Avenue
Broadway W
Willis Avenue
E 138th Street
Webster Avenue
Prospect Avenue
St Nicholas Avenue
Brook Avenue
S Boulevard
E Tremont av Street
E 149th Street
Cathedral Parkway
Courtlandt Street
Marginal Street
Columbus Circle
Cooper sq E
E Fordham rd Street
Kenmare Street
City Id Avenue
Wendover Avenue
E 169th Street
Manhattan Avenue
White Plains Road
Melrose Avenue
Jerome Avenue
E 102nd Street
Little W12th
E 187th Street
Arthur Avenue
E 180th Street
E 163rd Street
Central pk W
St Ann's Avenue
Tremont Avenue
E End av Street
Washington Square S
Gt Jones
Wilkins Avenue
W 8th Street
Villa Avenue
Forest Avenue
E 151st Street
E 174th Street
Freeman Street
Westchester Square
Pleasant Avenue
Longwood Avenue
Clay Avenue
Ogden Avenue
Edgecombe Avenue
W 22th Street
Claremont Avenue
Trinity Place
Harlem Market
Central Station
E 155th Street
Macomb's Road
E 165th Street
West Avenue
E 101st Street
E 143rd Street
Bergen Avenue
E 158th Street
Fox Street
E 137th Street
123rd Street
Morningside drive
E 150th Street
E 100th Street
Cypress Avenue
Bible h
Home Street
E 161st Street
W 18st Street
E 183rd Street
Alex Avenue
Central pk S
E 160th Street
Hughes Avenue
Bathgate Avenue
E 148th Street
Belmont Avenue
Ditmars City Id

### House Number

In [43]:
df['num_clean'] = df['num']
df.head(1)

,full,name,gender,country,region,address,street,num,street_clean,num_clean
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE,261 W 37th,W 37th,261,W 37th Street,261

In [44]:
no = dict(df['num_clean'].value_counts())
#sorted(no.items())

In [45]:
df['num_clean'] = df['num_clean'].apply(
    lambda x: x.replace('Grand', '0') if str(x).endswith('Grand') else x)

In [46]:
df['num_clean'] = df['num_clean'].apply(
    lambda x: x.replace('d', '') if str(x).endswith('d') else x)

In [47]:
df['num_clean'] = df['num_clean'].dropna().astype(str).astype(float).astype(int)

In [48]:
df.to_csv('cleaned/1913_address_CLEANED.csv')